<details ><summary>plan for oracle-fundaztic 2025-08-25 15:06:37 (UTC)</summary>
  <details open="true"><summary>Plan output</summary>

```terraform
Terraform will perform the following actions:

  # oci_core_instance.fundaztic_instance will be created
  + resource "oci_core_instance" "fundaztic_instance" {
      + availability_domain                 = "TFVD:AP-SINGAPORE-1-AD-1"
      + boot_volume_id                      = (known after apply)
      + capacity_reservation_id             = (known after apply)
      + compartment_id                      = "ocid1.compartment.oc1..aaaaaaaawutq5bmyehb2obqa3hcvstm5gzmboh62p7ixwwhdvgz2r73kvynq"
      + compute_cluster_id                  = (known after apply)
      + dedicated_vm_host_id                = (known after apply)
      + defined_tags                        = (known after apply)
      + display_name                        = "fundaztic-instance"
      + extended_metadata                   = (known after apply)
      + fault_domain                        = (known after apply)
      + freeform_tags                       = (known after apply)
      + hostname_label                      = (known after apply)
      + id                                  = (known after apply)
      + image                               = (known after apply)
      + instance_configuration_id           = (known after apply)
      + ipxe_script                         = (known after apply)
      + is_cross_numa_node                  = (known after apply)
      + is_pv_encryption_in_transit_enabled = (known after apply)
      + launch_mode                         = (known after apply)
      + metadata                            = {
          + "ssh_authorized_keys" = <<-EOT
                ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABAQDQKY5whUPcbXREkedakH7h3rIoQ5ZRezduUY7rjWLQiYPZZGYT3+fl9ZhiZdcQj1eQLU6BhuHvf5aRxgzth923TpK2fLuIvhMELi4oFWEbZyOtxA2H6OR9CM3DrhYsukQUAqO/JIHMkOKYAJodtpyOoSjLfP0O3VMwz4s8fd8KsMvMKP4JraLJ/D4ZcH5Qtpbs1fB/jb3neU+MtRq+TD0MAF9CLwagV+zTIXRQO6+FEt3dNyeaJ3xvEhZUkogNIq+6VZsytGMP80xYaXSHKmy9nuL2TJ/y/ODZVO0ICD4fhOjxJgvIVC6QqTNFX9B0E785/ykXHkCl7Fev07NcDP7L shern@LAPTOP-Q153SQDS
            EOT
          + "user_data"           = "IyEvYmluL2Jhc2gKc2V0IC1lCgojIEluc3RhbGwgRG9ja2VyIHByZXJlcXVpc2l0ZXMKc3VkbyBhcHQtZ2V0IHVwZGF0ZSAteQpzdWRvIGFwdC1nZXQgaW5zdGFsbCAteSBcCiAgICBjYS1jZXJ0aWZpY2F0ZXMgXAogICAgY3VybCBcCiAgICBnbnVwZyBcCiAgICBsc2ItcmVsZWFzZQoKIyBBZGQgRG9ja2Vy4oCZcyBvZmZpY2lhbCBHUEcga2V5CnN1ZG8gbWtkaXIgLXAgL2V0Yy9hcHQva2V5cmluZ3MKY3VybCAtZnNTTCBodHRwczovL2Rvd25sb2FkLmRvY2tlci5jb20vbGludXgvdWJ1bnR1L2dwZyB8IHN1ZG8gZ3BnIC0tZGVhcm1vciAtbyAvZXRjL2FwdC9rZXlyaW5ncy9kb2NrZXIuZ3BnCgojIFNldCB1cCB0aGUgRG9ja2VyIHJlcG8KZWNobyBcCiAgImRlYiBbYXJjaD0kKGRwa2cgLS1wcmludC1hcmNoaXRlY3R1cmUpIHNpZ25lZC1ieT0vZXRjL2FwdC9rZXlyaW5ncy9kb2NrZXIuZ3BnXSBcCiAgaHR0cHM6Ly9kb3dubG9hZC5kb2NrZXIuY29tL2xpbnV4L3VidW50dSBcCiAgJChsc2JfcmVsZWFzZSAtY3MpIHN0YWJsZSIgfCBzdWRvIHRlZSAvZXRjL2FwdC9zb3VyY2VzLmxpc3QuZC9kb2NrZXIubGlzdCA+IC9kZXYvbnVsbAoKIyBJbnN0YWxsIERvY2tlciBFbmdpbmUgKyBDTEkgKyBjb250YWluZXJkCnN1ZG8gYXB0LWdldCB1cGRhdGUgLXkKc3VkbyBhcHQtZ2V0IGluc3RhbGwgLXkgZG9ja2VyLWNlIGRvY2tlci1jZS1jbGkgY29udGFpbmVyZC5pbyBkb2NrZXItYnVpbGR4LXBsdWdpbiBkb2NrZXItY29tcG9zZS1wbHVnaW4KCiMgSW5zdGFsbCBPQ0kgQ0xJCmJhc2ggLWMgIiQoY3VybCAtTCBodHRwczovL3Jhdy5naXRodWJ1c2VyY29udGVudC5jb20vb3JhY2xlL29jaS1jbGkvbWFzdGVyL3NjcmlwdHMvaW5zdGFsbC9pbnN0YWxsLnNoKSIgLS0gXAogICAgLS1hY2NlcHQtYWxsLWRlZmF1bHRzCgojIEFkZCBPQ0kgQ0xJIHRvIFBBVEgKZWNobyAnZXhwb3J0IFBBVEg9JEhPTUUvLmxvY2FsL2JpbjokUEFUSCcgPj4gfi8uYmFzaHJjCnNvdXJjZSB+Ly5iYXNocmMKCiMgR2V0IE9DSVIgbmFtZXNwYWNlCk5BTUVTUEFDRT0kKG9jaSBvcyBucyBnZXQgLS1hdXRoIGluc3RhbmNlX3ByaW5jaXBhbCAtLXF1ZXJ5IGRhdGEgLS1yYXctb3V0cHV0KQpSRUdJT05fS0VZPSJzaW4iCgojIEZldGNoIE9DSVIgYXV0aCB0b2tlbiBmcm9tIE9DSSBWYXVsdCBzZWNyZXQKT0NJX0FVVEhfVE9LRU49JChvY2kgc2VjcmV0cyBzZWNyZXQtYnVuZGxlIGdldCBcCiAgLS1zZWNyZXQtaWQgb2NpZDEudmF1bHRzZWNyZXQub2MxLmFwLXNpbmdhcG9yZS0xLmFtYWFhYWFhZGlhM2txaWFiZmxncmxxc2N2YzJ2bmJ3MmQ0d3JqaHlsdnA2NWtjeGFhamV6M2g2c3VpcSBcCiAgLS1hdXRoIGluc3RhbmNlX3ByaW5jaXBhbCBcCiAgLS1xdWVyeSAiZGF0YS5cInNlY3JldC1idW5kbGUtY29udGVudFwiLmNvbnRlbnQiIFwKICAtLXJhdy1vdXRwdXQgfCBiYXNlNjQgLS1kZWNvZGUpCgojIERvY2tlciBsb2dpbiB0byBPQ0lSCmVjaG8gIiR7T0NJX0FVVEhfVE9LRU59IiB8IHN1ZG8gZG9ja2VyIGxvZ2luICR7UkVHSU9OX0tFWX0ub2Npci5pbyBcCi11ICIke05BTUVTUEFDRX0vc2VydmljZS11c2VyLWRvY2tlciIgLS1wYXNzd29yZC1zdGRpbgoKIyBBZGQgY3JvbiBqb2IgKGV2ZXJ5IDIgbWludXRlcykgZm9yIHJvb3QKKAogIHN1ZG8gY3JvbnRhYiAtbCAyPi9kZXYvbnVsbAogIGVjaG8gIiovMiAqICogKiAqIGRvY2tlciBwdWxsIHNpbi5vY2lyLmlvL2F4MWg5YnBoOG55by9mdW5kYXp0aWMvcHJvZDpsYXRlc3QgPj4gL3Zhci9sb2cvZnVuZGF6dGljLXNjcmFwZXIubG9nIDI+JjEgJiYgZG9ja2VyIHJ1biAtLXJtIHNpbi5vY2lyLmlvL2F4MWg5YnBoOG55by9mdW5kYXp0aWMvcHJvZDpsYXRlc3QgPj4gL3Zhci9sb2cvZnVuZGF6dGljLXNjcmFwZXIubG9nIDI+JjEiCikgfCBzdWRvIGNyb250YWIgLQoKIyBFbnN1cmUgY3JvbiBzZXJ2aWNlIGlzIGVuYWJsZWQgYW5kIHN0YXJ0ZWQKc3VkbyBzeXN0ZW1jdGwgZW5hYmxlIGNyb24Kc3VkbyBzeXN0ZW1jdGwgcmVzdGFydCBjcm9uCg=="
        }
      + private_ip                          = (known after apply)
      + public_ip                           = (known after apply)
      + region                              = (known after apply)
      + security_attributes                 = (known after apply)
      + security_attributes_state           = (known after apply)
      + shape                               = "VM.Standard.E4.Flex"
      + state                               = (known after apply)
      + subnet_id                           = (known after apply)
      + system_tags                         = (known after apply)
      + time_created                        = (known after apply)
      + time_maintenance_reboot_due         = (known after apply)

      + agent_config (known after apply)

      + availability_config {
          + is_live_migration_preferred = (known after apply)
          + recovery_action             = "RESTORE_INSTANCE"
        }

      + create_vnic_details {
          + assign_ipv6ip             = false
          + assign_private_dns_record = true
          + assign_public_ip          = "true"
          + defined_tags              = (known after apply)
          + display_name              = "vnic-fundaztic"
          + freeform_tags             = (known after apply)
          + hostname_label            = (known after apply)
          + nsg_ids                   = (known after apply)
          + private_ip                = (known after apply)
          + security_attributes       = (known after apply)
          + skip_source_dest_check    = (known after apply)
          + subnet_id                 = "ocid1.subnet.oc1.ap-singapore-1.aaaaaaaa3xj3vfnrydcs5rzpjm3uvsbcngpp63ztrq25asadefe777adb43q"
          + vlan_id                   = (known after apply)

          + ipv6address_ipv6subnet_cidr_pair_details (known after apply)
        }

      + instance_options {
          + are_legacy_imds_endpoints_disabled = true
        }

      + launch_options (known after apply)

      + launch_volume_attachments (known after apply)

      + licensing_configs (known after apply)

      + placement_constraint_details (known after apply)

      + platform_config (known after apply)

      + preemptible_instance_config (known after apply)

      + shape_config {
          + baseline_ocpu_utilization     = (known after apply)
          + gpu_description               = (known after apply)
          + gpus                          = (known after apply)
          + local_disk_description        = (known after apply)
          + local_disks                   = (known after apply)
          + local_disks_total_size_in_gbs = (known after apply)
          + max_vnic_attachments          = (known after apply)
          + memory_in_gbs                 = 4
          + networking_bandwidth_in_gbps  = (known after apply)
          + nvmes                         = (known after apply)
          + ocpus                         = 1
          + processor_description         = (known after apply)
          + vcpus                         = (known after apply)
        }

      + source_details {
          + boot_volume_size_in_gbs = (known after apply)
          + boot_volume_vpus_per_gb = (known after apply)
          + source_id               = "ocid1.image.oc1.ap-singapore-1.aaaaaaaaijbd2tsltpwcgvosleso3zrjqbfuhsw3vqkufr364jjoff7pijmq"
          + source_type             = "image"

          + instance_source_image_filter_details (known after apply)
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────
```
</details>
</details>